Core/src/Reports/ПлатежныйКалендарь/ПлатежныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПлатежныйКалендарь</name>
  <attributes>
    <name>ПериодПросроченныхПлатежей</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодБудущихПлатежей</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Core/src/Reports/ПлатежныйКалендарь/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Теги = НСтр("ka='Деньги,План,Платежи';ru='Деньги,План,Платежи'");
	
	НастройкиВариантов["Основной"].Рекомендуемый = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПериодПросроченныхПлатежей.ДатаНачала > РабочаяДата Тогда
		ТекстОшибки = НСтр("ka='Период просроченных платежей не может быть больше текущей даты. Формирование отчета отменено.';ru='Период просроченных платежей не может быть больше текущей даты. Формирование отчета отменено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Неопределено, // ОбъектИлиСсылка
			"ПериодПросроченныхПлатежей",
			"Отчет", // ПутьКДанным
			Отказ
		);
	КонецЕсли;

	Если ПериодБудущихПлатежей.ДатаОкончания < РабочаяДата Тогда
		ТекстОшибки = НСтр("ka='Период будущих платежей не может быть меньше текущей даты. Формирование отчета отменено.';ru='Период будущих платежей не может быть меньше текущей даты. Формирование отчета отменено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Неопределено, // ОбъектИлиСсылка
			"ПериодБудущихПлатежей",
			"Отчет", // ПутьКДанным
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли
